SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Source/IAR_StartAsm/startup_mm32f5370_iar.s
; Reset Handler

                PUBWEAK Reset_Handler
                SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler

                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0


                PUBWEAK NMI_Handler
                PUBWEAK HardFault_Handler
                PUBWEAK MemManage_Handler
                PUBWEAK BusFault_Handler
                PUBWEAK UsageFault_Handler
                PUBWEAK SVCall_Handler
                PUBWEAK DebugMon_Handler
                PUBWEAK PendSV_Handler
                PUBWEAK SysTick_Handler
                PUBWEAK WWDG_IWDG_IRQHandler    
                PUBWEAK PVD_IRQHandler          
                PUBWEAK BKP_TAMPER_IRQHandler   
                PUBWEAK RTC_IRQHandler          
                PUBWEAK FLASH_IRQHandler        
                PUBWEAK RCC_CRS_IRQHandler      
                PUBWEAK EXTI0_IRQHandler        
                PUBWEAK EXTI1_IRQHandler        
                PUBWEAK EXTI2_IRQHandler        
                PUBWEAK EXTI3_IRQHandler        
                PUBWEAK EXTI4_IRQHandler        
                PUBWEAK DMA1_CH1_IRQHandler     
                PUBWEAK DMA1_CH2_IRQHandler     
                PUBWEAK DMA1_CH3_IRQHandler     
                PUBWEAK DMA1_CH4_IRQHandler     
                PUBWEAK DMA1_CH5_IRQHandler     
                PUBWEAK DMA1_CH6_IRQHandler     
                PUBWEAK DMA1_CH7_IRQHandler     
                PUBWEAK ADC1_2_IRQHandler       
                PUBWEAK DMA1_CH8_IRQHandler     
                PUBWEAK FLEXCAN1_IRQHandler     
                PUBWEAK EXTI9_5_IRQHandler      
                PUBWEAK TIM1_BRK_IRQHandler     
                PUBWEAK TIM1_UP_IRQHandler      
                PUBWEAK TIM1_TRG_COM_IRQHandler 
                PUBWEAK TIM1_CC_IRQHandler      
                PUBWEAK TIM2_IRQHandler         
                PUBWEAK TIM3_IRQHandler         
                PUBWEAK TIM4_IRQHandler         
                PUBWEAK I2C1_IRQHandler         
                PUBWEAK I2C2_IRQHandler         
                PUBWEAK SPI1_IRQHandler         
                PUBWEAK SPI2_IRQHandler         
                PUBWEAK USART1_IRQHandler       
                PUBWEAK USART2_IRQHandler       
                PUBWEAK USART3_IRQHandler       
                PUBWEAK EXTI15_10_IRQHandler    
                PUBWEAK RTC_ALR_IRQHandler      
                PUBWEAK USB_WKUP_IRQHandler     
                PUBWEAK TIM8_BRK_IRQHandler     
                PUBWEAK TIM8_UP_IRQHandler      
                PUBWEAK TIM8_TRG_COM_IRQHandler 
                PUBWEAK TIM8_CC_IRQHandler      
                PUBWEAK ADC3_IRQHandler         
                PUBWEAK TIM5_IRQHandler         
                PUBWEAK SPI3_IRQHandler         
                PUBWEAK USART4_IRQHandler       
                PUBWEAK USART5_IRQHandler       
                PUBWEAK TIM6_IRQHandler         
                PUBWEAK TIM7_IRQHandler         
                PUBWEAK DMA2_CH1_IRQHandler     
                PUBWEAK DMA2_CH2_IRQHandler     
                PUBWEAK DMA2_CH3_IRQHandler     
                PUBWEAK DMA2_CH4_IRQHandler     
                PUBWEAK DMA2_CH5_IRQHandler     
                PUBWEAK COMP_IRQHandler         
                PUBWEAK FLEXCAN2_IRQHandler     
                PUBWEAK USBFS_IRQHandler        
                PUBWEAK DMA2_CH6_IRQHandler     
                PUBWEAK DMA2_CH7_IRQHandler     
                PUBWEAK DMA2_CH8_IRQHandler     
                PUBWEAK RAM_IRQHandler          
                PUBWEAK QSPI_IRQHandler         
                PUBWEAK LPTIM_IRQHandler        
                PUBWEAK LPUART_IRQHandler       
                PUBWEAK MDPWM_BRK_IRQHandler    
                PUBWEAK MDPWM_UPERR_IRQHandler  
                PUBWEAK MDPWM_UP0_IRQHandler    
                PUBWEAK MDPWM_CC0_IRQHandler    
                PUBWEAK MDPWM_UP1_IRQHandler    
                PUBWEAK MDPWM_CC1_IRQHandler    
                PUBWEAK MDPWM_UP2_IRQHandler    
                PUBWEAK MDPWM_CC2_IRQHandler    
                PUBWEAK MDPWM_UP3_IRQHandler    
                PUBWEAK MDPWM_CC3_IRQHandler    

                SECTION .text:CODE:REORDER:NOROOT(1)
				
NMI_Handler
HardFault_Handler
MemManage_Handler
BusFault_Handler
UsageFault_Handler
SVCall_Handler
DebugMon_Handler
PendSV_Handler
SysTick_Handler
WWDG_IWDG_IRQHandler    
PVD_IRQHandler          
BKP_TAMPER_IRQHandler   
RTC_IRQHandler          
FLASH_IRQHandler        
RCC_CRS_IRQHandler      
EXTI0_IRQHandler        
EXTI1_IRQHandler        
EXTI2_IRQHandler        
EXTI3_IRQHandler        
EXTI4_IRQHandler        
DMA1_CH1_IRQHandler     
DMA1_CH2_IRQHandler     
DMA1_CH3_IRQHandler     
DMA1_CH4_IRQHandler     
DMA1_CH5_IRQHandler     
DMA1_CH6_IRQHandler     
DMA1_CH7_IRQHandler     
ADC1_2_IRQHandler       
DMA1_CH8_IRQHandler     
FLEXCAN1_IRQHandler     
EXTI9_5_IRQHandler      
TIM1_BRK_IRQHandler     
TIM1_UP_IRQHandler      
TIM1_TRG_COM_IRQHandler 
TIM1_CC_IRQHandler      
TIM2_IRQHandler         
TIM3_IRQHandler         
TIM4_IRQHandler         
I2C1_IRQHandler         
I2C2_IRQHandler         
SPI1_IRQHandler         
SPI2_IRQHandler         
USART1_IRQHandler       
USART2_IRQHandler       
USART3_IRQHandler       
EXTI15_10_IRQHandler    
RTC_ALR_IRQHandler      
USB_WKUP_IRQHandler     
TIM8_BRK_IRQHandler     
TIM8_UP_IRQHandler      
TIM8_TRG_COM_IRQHandler 
TIM8_CC_IRQHandler      
ADC3_IRQHandler         
TIM5_IRQHandler         
SPI3_IRQHandler         
USART4_IRQHandler       
USART5_IRQHandler       
TIM6_IRQHandler         
TIM7_IRQHandler         
DMA2_CH1_IRQHandler     
DMA2_CH2_IRQHandler     
DMA2_CH3_IRQHandler     
DMA2_CH4_IRQHandler     
DMA2_CH5_IRQHandler     
COMP_IRQHandler         
FLEXCAN2_IRQHandler     
USBFS_IRQHandler        
DMA2_CH6_IRQHandler     
DMA2_CH7_IRQHandler     
DMA2_CH8_IRQHandler     
RAM_IRQHandler          
QSPI_IRQHandler         
LPTIM_IRQHandler        
LPUART_IRQHandler       
MDPWM_BRK_IRQHandler    
MDPWM_UPERR_IRQHandler  
MDPWM_UP0_IRQHandler    
MDPWM_CC0_IRQHandler    
MDPWM_UP1_IRQHandler    
MDPWM_CC1_IRQHandler    
MDPWM_UP2_IRQHandler    
MDPWM_CC2_IRQHandler    
MDPWM_UP3_IRQHandler    
MDPWM_CC3_IRQHandler    

Default_Handler
                B       .
                END


